app/controllers/items_controller.rb

INSERT INTO "items" ("part_number", "list_price", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["part_number", "bob"], ["list_price", "123.0"], ["created_at", "2018-01-05 02:27:46.315422"], ["updated_at", "2018-01-05 02:27:46.315422"]]
---
  def create
    item = Item.create item_params

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def edit
    @item = Item.find params[:id]

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
UPDATE "items" SET "part_number" = $1, "updated_at" = $2 WHERE "items"."id" = $3  [["part_number", "AM2852"], ["updated_at", "2018-01-05 01:52:20.667101"], ["id", 11]]
---
  def update
    item = Item.find params[:id]
    item.update item_params

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def show
    @item = Item.find_by :id => params[:id]

SELECT  "items".* FROM "items" WHERE "items"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
DELETE FROM "items" WHERE "items"."id" = $1  [["id", 14]]
---
  def destroy
    items = Item.find params[:id]
    items.destroy