app/controllers/sales_orders_controller.rb

SELECT "sales_orders".* FROM "sales_orders"
---
  def index
    @sales_orders = SalesOrder.all

INSERT INTO "sales_orders" ("customer_PO_number", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["customer_PO_number", "sss"], ["created_at", "2018-01-05 03:25:02.530810"], ["updated_at", "2018-01-05 03:25:02.530810"]]
---
  def create
    sales_order = SalesOrder.create sales_order_params

SELECT  "sales_orders".* FROM "sales_orders" WHERE "sales_orders"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def edit
    @sales_order = SalesOrder.find params[:id]

SELECT  "sales_orders".* FROM "sales_orders" WHERE "sales_orders"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
UPDATE "sales_orders" SET "customer_PO_number" = $1, "updated_at" = $2 WHERE "sales_orders"."id" = $3  [["customer_PO_number", "ABC123s"], ["updated_at", "2018-01-05 03:23:52.867741"], ["id", 10]]
---
  def update
    sales_order = SalesOrder.find params[:id]
    sales_order.update sales_order_params

SELECT  "sales_orders".* FROM "sales_orders" WHERE "sales_orders"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
---
  def show
    @sales_order = SalesOrder.find_by :id => params[:id]